Repository: Kaicastledine/canape
Catalog: CANAPE.Controls/Controls/ProxyClientControl.*.resx
Languages: de

# btnPACScript.Text
source: Set Script
de: Setze Skript

# btnPACScript.ToolTip
source: Click to change script
de: Klicke um das Skript zu ändern

# radioButtonPac.Text
source: PAC Script
de: PAC Skript

# radioButtonPac.ToolTip
source: Check to specify a PAC script
de: Wähle um ein PAC Skript zu setzen

# radioDefault.Text
source: Use Project Default
de: Standard

# radioDefault.ToolTip
source: Use the projects default (modified by selecting then right clicking the project root in the explorer and choosing properties)
de: Standardeinstellungen

# radioSystem.Text
source: Use System Proxy
de: System Proxy

# radioSystem.ToolTip
source: Use the currently configured system settings
de: Benutzte die aktuellen Systemeigenschaften

# radioProxy.Text
source: Specify Proxy
de: Wähle Proxy

# radioProxy.ToolTip
source: Specify a proxy for this connection
de: Wähle einen Proxy für diese Verbindung

# radioDirect.Text
source: Direct Connection
de: Direkte Verbindung

# radioDirect.ToolTip
source: Make a direct connection to destination address
de: Erstellt eine direkte Verbindung zur Zieladresse

# groupBoxConnectionType.Text
source: Connection Type
de: Verbindungsart

# groupBoxConnectionType.ToolTip
source: Specify client connection type
de: Spezifiziere den Typ der Benutzerverbindung

# checkBoxSendHostName.Text
source: Send Hostname for SOCKS
de: Sende Hostname für SOCKS

# checkBoxSendHostName.ToolTip
source: Check to send hostname to SOCKS proxy over versions 5 or 4a
de: Wähle um den Hostnamen zum SOCKS proxy zu senden (Version > 4a/5)

# checkBoxIpv6.ToolTip
source: Specify the connection should be made over IPv6
de: Spezifiziere, dass die Verbindung über IPv6 erstellt werden solll

# radioHttp.ToolTip
source: Check to specify HTTP proxy
de: Wähle um einen HTTP Proxy zu spezifizieren

# radioSocksv4.ToolTip
source: Check to specify SOCKS 4 proxy
de: Wähle um einen SOCKS 4 Proxy zu spezifizieren

# radioSocksv5.ToolTip
source: Check to specify SOCKS 5 proxy
de: Wähle um einen SOCKS 5 Proxy zu spezifizieren

# numericUpDownPort.ToolTip
source: Specify the port number for the proxy server
de: Spezifiziere den Port für den Proxy Server

# textBoxHost.ToolTip
source: Specifies the hostname of the proxy server
de: Spezifiziere den Hostnamen für den Proxy Server

# groupBoxDetails.Text
source: Proxy Configuration
de: Proxy Konfiguration
