Repository: Kaicastledine/canape
Catalog: CANAPE.Controls/Controls/SslConfigControl.*.resx
Languages: de

# radioSpecify.Text
source: Specify
de: Spezifiziere

# radioSpecify.ToolTip
source: Check to specify server certificate manually
de: Wähle um ein Serverzertifikat manuell anzugeben

# radioAuto.Text
source: Auto Generate
de: Automatisch

# radioAuto.ToolTip
source: Check to auto-generate server certificate based on real server
de: Wähle um Serverzertifikate automatisch anhand von echten Servern zu generieren

# groupBox.Text
source: Certificate Mode
de: Zertifikat Modus

# groupBox.ToolTip
source: Specify server certificate mode
de: Spezifiziere Serverzertifikat Modus

# textBoxSubject.ToolTip
source: Subject name for manual certificate
de: Subjekt Name für manuell erstelltes Zertifikat

# buttonLoadFromFile.Text
source: Load File
de: Lade Datei

# buttonLoadFromFile.ToolTip
source: Load a certificate from PFX or OpenSSL files
de: Lade ein Zertifikat aus PFX oder OpenSSL Dateien

# buttonLoadStore.Text
source: Load Store
de: Lade Speicher

# buttonLoadStore.ToolTip
source: Load a certificate from the certificate store (e.g. for smartcards)
de: Lade ein Zertifikat aus dem Zertifikatsspeicher (z.B. Smartcards)

# buttonView.Text
source: View
de: Zeige

# buttonView.ToolTip
source: View the currently loaded certificate
de: Zeige das momentan geladenen Zertifikat

# labelSubjectName.Text
source: Subject Name:
de: Objektname:

# buttonCreate.Text
source: Create
de: Erstelle

# buttonCreate.ToolTip
source: Create a new certificate signed with CANAPE root
de: Erstelle ein neues mit dem CANAPE Rootzertifikat signiertes Zertifikat

# lblClientCert.Text
source: Client Certificate:
de: Benutzerzertifikat:

# textBoxClientCert.ToolTip
source: Subject name for the specified client certificate
de: Das Subjekt für das spezifizierte Benutzerzertifikat

# buttonClear.Text
source: Clear
de: Lösche

# buttonClear.ToolTip
source: Clear the client certificate setting
de: Lösche die benutzerspezifischen Zertifikatseinstellungen

# btnLoadClient.Text
source: Load File
de: Lade Datei

# btnLoadClient.ToolTip
source: Load a certificate from PFX or OpenSSL files
de: Lade ein Zertifikat aus PFX oder OpenSSL Dateien

# btnViewClient.Text
source: View
de: Zeige

# btnViewClient.ToolTip
source: View the currently loaded certificate
de: Zeige die momentan geladenen Zertifikate

# btnLoadStoreClient.Text
source: Load Store
de: Lade Speicher

# btnLoadStoreClient.ToolTip
source: Load a certificate from the certificate store (e.g. for smartcards)
de: Lade ein Zertifikat aus dem Zertifikatsspeicher (z.B. Smartcards)

# checkBoxSsl.Text
source: Enable SSL
de: Aktiviere SSL

# checkBoxSsl.ToolTip
source: Check to enable SSL MitM
de: Wähle um SSL MitM zu aktivieren

# btnAdvancedOptions.Text
source: Advanced Options
de: Erweiterte Optionen

# btnAdvancedOptions.ToolTip
source: Click to show advanced SSL options
de: Klicke um die erweiterten SSL Optionen anzuzeigen
