Repository: Kaicastledine/canape
Catalog: CANAPE.Controls/Forms/CreateCertForm.*.resx
Languages: de

# radioButtonSelfSign.Text
source: Self
de: Selbstsignieren

# radioButtonSelfSign.ToolTip
source: Self sign the certificate
de: Das Zertifikat selbst signieren

# textBoxSubject.ToolTip
source: Shows the specified CA subject name
de: Zeigt den spezifizierten CA Namen an

# btnLoadStore.Text
source: Load Store
de: Lade Speicher

# btnLoadStore.ToolTip
source: Load CA from the certificate store
de: Lade Zertifikat aus dem Zertifikatsspeicher

# radioButtonDefaultCA.Text
source: Default CA
de: Standardzertifikat

# radioButtonDefaultCA.ToolTip
source: Check to use default CANAPE CA
de: Wähle um das CANAPE Standardzertifikat zu nutzen

# btnLoadFile.Text
source: Load File
de: Lade Datei

# btnLoadFile.ToolTip
source: Load CA from a file
de: Lade Zertifikat aus Datei

# radioButtonSpecifyCA.Text
source: Specify CA
de: Spezifiziere Zertifikat

# radioButtonSpecifyCA.ToolTip
source: Check to specify a specific CA
de: Wähle um ein Zertifikat zu spezifizieren

# groupBoxSigning.Text
source: Signing Certificate
de: Signiere Zertifikat

# textBoxCN.ToolTip
source: Specify the common name (normally the domain name) for the certificate
de: Spezifiziere den "common name" (meist Domainname) für das Zertifikat

# buttonCreate.Text
source: Create
de: Erstellen

# buttonCancel.Text
source: Cancel
de: Abbrechen

# btnLoadStoreCert.Text
source: Load Store
de: Lade Speicher

# btnLoadStoreCert.ToolTip
source: Load CA from the certificate store
de: Lade Zertifikat aus dem Zertifikatsspeicher

# btnLoadFileCert.Text
source: Load File
de: Lade Datei

# btnLoadFileCert.ToolTip
source: Load CA from a file
de: Lade Zertifikat aus Datei

# radioButtonSimpleCN.Text
source: Simple CN
de: Einfacher Common Name

# radioButtonTemplate.Text
source: From Template
de: Aus Vorlage

# groupBoxCert.Text
source: Certificate
de: Zertifikat

# $this.Text
source: Create Certificate
de: Erstelle Zertifikat
