Repository: Kaicastledine/canape
Catalog: CANAPE.Gui/Forms/ConfigurationForm.*.resx
Languages: de

# checkBoxCompress.Text
source: Compress Output
de: Projekt komprimieren

# checkBoxCompress.ToolTip
source: Enable project compression, will slow down saving
de: Aktiviere Projektkomprimierung, hierdurch wird das Speichern verlangsamt

# checkBoxBackup.Text
source: Backup Project File
de: Projektdatei sichern

# checkBoxBackup.ToolTip
source: Always make a backup of a project file if it already exists
de: Erstelle immer eine Kopie einer Projektdatei, sofern diese bereits existiert

# groupBoxSavingAndLoading.Text
source: Saving and Loading
de: Laden und Speichern

# groupBoxSavingAndLoading.ToolTip
source: Options for saving and loading projects
de: Optionen zum Speichern und Laden von Projekten

# labelUIOptions.Text
source: Specify User Interface Options
de: Spezifizieren Sie die Benutzeroberflächenoptionen

# btnCancel.Text
source: Cancel
de: Abbrechen

# labelClientHelp.Text
source: Specify the default client
de: Spezifizieren Sie den Standardclient

# tabPageClient.Text
source: Default Client
de: Standardclient

# labelScriptHelp.Text
source: Specify options for the script editor window. You will need to close existing script windows for the settings to take effect
de: Spezifizieren Sie Optionen für den Editor. Sie werden bereits existierende Skriptfenster schließen müssen, damit die Änderungen übernommen werden.

# tabPageScriptEditor.Text
source: Script Editor
de: Skript Editor

# checkBoxCheckUpdates.Text
source: Automatically check for updates
de: Automatisch nach Aktualisierungen suchen

# checkBoxCheckUpdates.ToolTip
source: Enable automatic update checking
de: Aktiviere automatische Aktualisierung

# label1.Text
source: Miscellaneous options
de: Sonstige Optionen

# tabPageOthers.Text
source: Misc
de: Sonstiges

# lblLanguage.Text
source: Language:
de: Sprache:

# label2.Text
source: Log Viewer Confirm:
de: Loganzeiger bestätigen

# comboBoxLogConfirm.Items
source: Confirm Save
de: Speichern bestätigen

# comboBoxLogConfirm.Items1
source: Auto Save
de: Automatisches Speichern

# comboBoxLogConfirm.Items2
source: Auto Revert
de: Automatisches Zurücknehmen

# comboBoxLogConfirm.ToolTip
source: Specify confirmation when a log viewer is closed with modified packets
de: Spezifiziere die Bestätigung, wenn ein Logbetrachter mit modifizierten Paketen geschlossen wird

# checkBoxRequireEventLogClearConfirm.Text
source: Require Confirmation to Clear Event Log
de: Bestätigung zum Eventlog löschen

# checkBoxRequireEventLogClearConfirm.ToolTip
source: Check to require a confirmation before clearing an event log
de: Wählen, für eine Bestätigung vor dem Löschen des Ereignislog

# checkBoxRequirePacketLogClearConfirm.Text
source: Require Confirmation to Clear Packet Log
de: Bestätigung um Packetlog zu löschen

# checkBoxRequirePacketLogClearConfirm.ToolTip
source: Check to require a confirmation before clearing a packet log
de: Wählen, für eine Bestätigung vor dem Löschen eines Ereignislog

# checkBoxNewStyle.Text
source: New Style Log Viewer
de: Log im neuen Stil anzeigen

# checkBoxNewStyle.ToolTip
source: Enable new style log viewer mode, overrides packet log mutable
de: Neuen Loganzeigemodus verwenden, überschreibt die Veränderbarkeit des Paketlogs

# checkBoxConfirmClose.Text
source: Require Confirmation on Close
de: Beim Schließen bestätigen

# checkBoxConfirmClose.ToolTip
source: Require confirmation to close Canape
de: Erfordere Bestätigung um Canape zu schließen

# btnClearHistory.Text
source: Clear History
de: Verlauf löschen

# btnClearHistory.ToolTip
source: Clear the current project history
de: Lösche den aktuellen Projektverlauf

# checkBoxPacketLogMutable.Text
source: Service Packet Log Mutable
de: Veränderbares Servicepaketlog

# checkBoxPacketLogMutable.ToolTip
source: Check to make network service packet logs default to mutable
de: Wählen, um Netzwerkpaketlogs standardmäßig veränderbar zu machen

# checkBoxShowStartupForm.Text
source: Show startup dialog
de: Startdialog anzeigen

# checkBoxShowStartupForm.ToolTip
source: Show the template selection dialog at startup
de: Zeige die Templateauswahl beim Starten

# checkBoxShowSplash.Text
source: Show splash screen
de: Startbild anzeigen

# checkBoxShowSplash.ToolTip
source: Show the splash screen at start up
de: Zeige das Splash Bild beim Starten

# tabPageUI.Text
source: User Interface
de: Benutzeroberfläche

# $this.Text
source: CANAPE Configuration
de: CANAPE Konfiguration
