Repository: Kaicastledine/canape
Catalog: CANAPE.Gui/Properties/Resources.*.resx
Languages: de

# DocumentForm_NoRegisteredEditor
source: No editor available for '{0}'
de: Es ist kein Editor für '{0}' vorhanden

# MessageBox_ErrorString
source: Error
de: Fehler

# LoadProject_OpenAnyway
source: {0} This might not open correctly. Do you want to continue to load?
de: Die Version des Projektes ist neuer als die CANAPE Version. Soll diese wirklich geladen werden?

# LoadProject_OpenAnywayCaption
source: Open Anyway?
de: Wirklich öffnen?

# MainForm_NoUpdateAvailable
source: No new updates are available
de: Es wird die aktuellste CANAPE Version verwendet

# MainForm_NoUpdateAvailableCaption
source: No new updates
de: Es wird die aktuellste CANAPE Version verwendet

# FatalError_Caption
source: Fatal Error
de: Schwerwiegender Fehler

# FatalError_Message
source: Sorry, a Fatal Error occurred. Please send the file {0} to the developer to help diagnose the issue. Exiting
de: Es ist ein schwerwiegender Fehler aufgetreten. Die Datei {0} sollte zum Entwickler gesendet werden, um ihn das Problem finden zu lassen. Die Anwendung wird beendet!

# OpenFileDialog_ProjectFilter
source: Project Files (*.canape)|*.canape|All Files (*.*)|*.*
de: Projektdateien (*.canape)|*.canape|Alle Dateien (*.*)|*.*

# StartupForm_SelectPreviousItem
source: Please select previous file to open
de: Wählen Sie eine vorherige Datei zum Öffnen aus

# StartupForm_SelectPreviousItemCaption
source: Select File
de: Wählen Sie eine Datei aus

# Program_CheckForUpdates
source: Do you want to enable automatic update checking? This setting can be changed later in the program configuration.
de: Soll die automatische Überprüfung nach Updates eingeschaltet werden? Diese Einstellung kann später in der Konfiguration geändert werden

# Program_CheckForUpdatesCaption
source: Enable Update Check?
de: Aktualisierungsüberprüfung aktivieren?

# MainForm_CertSaveFilter
source: Certificate Files (*.cer)|*.cer|All Files (*.*)|*.*
de: Zertifikatdateien (*.cer)|*.cer|Alle Dateien (*.*)|*.*

# MainForm_ProjectModified
source: Project has been modified, do you want to save?
de: Das Projekt wurde geändert. Sollen die Änderungen gespeichert werden?

# MainForm_ProjectModifiedCaption
source: Save Modified?
de: Änderungen speichern?

# MainForm_UnknownError
source: Unknown error occurred loading file
de: Ein unbekannter Fehler trat beim Laden der Datei auf

# MainForm_UntitledFile
source: (Untitled)
de: (Unbenannt)

# SavingLoadingForm_Loading
source: Loading from {0}
de: Lade von {0}

# SavingLoadingForm_Saving
source: Saving to {0}
de: Speichere als {0}

# MainForm_ConfirmExit
source: Do you want to close CANAPE?
de: Soll CANAPE wirklich beendet werden?

# MainForm_ConfirmExitCaption
source: Close?
de: Schließen?

# ConfigurationForm_ClearHistory
source: Do you want to clear the project history?
de: Soll der Projektverlauf gelöscht werden?

# ConfigurationForm_ClearHistoryCaption
source: Clear History?
de: Verlauf leeren?

# CreateCert_SaveFilter
source: PFX Certificate (*.pfx;*.p12)|*.pfx;*.p12|Certificate Files (*.cer,*.pem,*.crt)|*.cer;*.pem;*.crt|All Files (*.*)|*.*
de: PFX-Zertifikat (*.pfx;*.p12)|*.pfx;*.p12|Zertifikatdateien (*.cer,*.pem,*.crt)|*.cer;*.pem;*.crt|Alle Dateien (*.*)|*.*

# ConfigurationForm_MustRestartToChangeLanguage
source: You must restart CANAPE to change the user interface language
de: CANAPE muss neugestartet werden, um die Benutzersprache zu ändern

# ConfigurationForm_MustRestartToChangeLanguageCaption
source: Language Changed
de: Sprache geändert

# MainForm_RootCertAlreadyInstalled
source: The root certificate is already installed
de: Das Zertifikat ist bereits installiert
