Repository: Kaicastledine/canape
Catalog: CANAPE.NodeLibrary/Properties/Resources.*.resx
Languages: de

# ReplayByTagDataEndpointConfig_ConvertToBasicDescription
source: If true then the packets are converted back to a basic byte form before sending
de: Wenn wahr, werden die Pakete in eine einfache Byteform konvertiert, bevor diese gesendet werden

# ReplayByTagDataEndpointConfig_PacketsDescription
source: The log of packets to use when sending packets
de: Der Paketlog der verwendet werden soll, wenn die Pakete gesendet werden

# ReplayByTagDataEndpointConfig_ReplayEntriesDescription
source: A set of replay entries which define the matching conditions and the tag to send
de: Eine Sammlung von Wiederholungseinträgen, die die Übereinstimmungsbedingungen und die Markierung bestimmen die gesendet werden soll

# ReplayByTagDataEndpointConfig_TagOnStartDescription
source: Tag of packets to send on initial connection, if empty then no packets sent
de: Gibt die Markierung der Pakete an, die bei einem Verbungsaufbau gesendet werden soll. Sofern diese leer sind, werden keine Pakete gesendet

# ReplayByTagEntryFactory_TagDescription
source: The tag to match to determine what packets to send
de: Gibt die Markierung für eine Übereinstimmung an, um festzustellen welche Pakete gesendet werden

# ReplayByTagEntryFactory_CloseAfterSendDescription
source: Indicates whether to close the connection after sending the packets
de: Stellt fest ob die Verbindung geschlossen werden soll nachdem das Paket gesendet wurde

# ReplayByTagEntryFactory_FiltersDescription
source: List of filters to apply to incoming packets to determine whether to send the packets
de: Liste an Filtern die angewendet werden sollen, um festzustellen ob die Pakete gesendet werden

# ReplayByTagEntryFactory_MatchAllFiltersDescription
source: Indicates all filters must match
de: Gibt an, dass alle Filter matchen müssen

# ReplayByTagEntryFactory_RepeatCountDescription
source: Indicates the number of times to send the tagged packets
de: Gibt an, wie oft das markierte Paket gesendet werden soll

# ReplayByTagDataEndpoint_Name
source: Full Replay by Tag Endpoint
de: Komplette Wiederholung beim Markierungsendpunkt

# ReplayByTagDataEndpoint_Description
source: A replay endpoint which returns specifically tagged packets in a log in response to an incoming packet
de: Ein Wiederholungsendpunkt, der als Antwort auf ein hereinkommendes Paket ein speziel markiertes Paket in einem Log zurückgibt

# ReplayByTagDataEndpoint_NodeName
source: Tag Replay Endpoint
de: Wiederholungsendpunkt markieren

# HttpResponseStreamParser_Name
source: HTTP Response Parser
de: HTTP Antworten Parser

# HttpResponseStreamParser_Description
source: This is a HTTP response parser to apply to a stream
de: HTTP Antworten Parser für einen Stream

# HttpResponseStreamParser_NodeName
source: HTTP Response
de: HTTP Antwort

# NumericStringFuzzerNodeConfig_StartValueDescription
source: Specify the starting value for the fuzz
de: Gibt den Startwert für das Fuzzen an

# NumericStringFuzzerNodeConfig_EndValueDescription
source: Specify the ending value for the fuzz
de: Gibt ein Ende für das Fuzzen an

# NumericStringFuzzerNodeConfig_IncrementDescription
source: Specify the increment between values
de: Gibt die Inkrementierung zwischen zwei Werten an

# NumericStringFuzzerNodeConfig_FormatDescription
source: Specify basic format, unless CustomFormat is specified
de: Gibt das Basisformat an, außer wenn CustomFormat angegeben wurde

# NumericStringFuzzerNodeConfig_CustomFormatDescription
source: Specify a custom .NET format string for the value
de: Gibt einen eigenen .NET Format String für den Wert an

# NumericStringFuzzerNodeConfig_StoreLocalPositionDescription
source: Store the current fuzz position as a local value, it will not persist between connections
de: Speichert den aktuellen Fuzzwert als lokale Variable, dies ist nicht innerhalb von 2 Verbindungen beständigt

# NumericStringFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed value should be logged as text
de: Gibt an, ob der gefuzzte Wert als Text geloggt werden soll

# NumericStringFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, dass die Pakete vor und nach dem Fuzzen gespeichert werden

# NumericStringFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# NumericStringFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting string position to fuzz
de: Gibt die Startposition zum Fuzzen an

# NumericStringFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means string.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen von der Startposition an. Kleiner als 0 bedeutet string.length - fuzzlength + 1

# NumericStringFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, dass mitgeschnittene Packete zu Bytes konvertiert werden, bevor diese mitgeschnitten werden.

# NumericStringFuzzerNodeConfig_BinaryEncodingDescription
source: Specify the encoding to use if the nodes are not strings
de: Gibt die Enkodierung an, falls die Knoten keine Strings sind

# NumericStringFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to strings for fuzzing, just ignore them
de: Konvertiere beim Fuzzen keine Knoten zu Strings, sondern ignoriere diese

# NumericStringFuzzerNodeConfig_RegexMatchDescription
source: Specify a regex match to use to determine parts to fuzz. Replaces any matches within the selected range
de: Gibt einen Regexmatch an, um anzugeben welche Teile gefuzzt werden sollen. Dies ersetzt alle Übereinstimmungen im angegebenen Bereich

# NumericStringFuzzerNodeConfig_CaseSensitiveDescription
source: Specify the regex is casesensitive
de: Gibt an, ob der Regex Groß-/Kleinschreibung beachtet

# NumericStringFuzzerNodeConfig_MultilineDescription
source: Specify the regex is multiline
de: Gibt an, dass der reguläre Ausdruck über mehrere Zeilen geht

# NumericStringFuzzerNodeConfig_MaxReplacementsDescription
source: Specify the maximum number of replacements when using a regular expression, -1 means all
de: Gibt die maximale Anzahl an Ersetzungen bei regulären Ausdrücken an, -1 heißt alle

# NumericStringFuzzerNode_Name
source: Numeric String Fuzzer Node
de: Numerischer String Fuzzerknoten

# NumericStringFuzzerNode_Description
source: A node to fuzz parts of a string with an incrementing value
de: Ein Knoten, welcher einen Teil eines Strings durch inkrementieren fuzzt

# NumericStringFuzzerNode_NodeName
source: Numeric String Fuzzer
de: Numerischer String Fuzzer

# SplitterNode_Description
source: A node to split a packet up based on a selection path into multiple packets
de: Ein Knoten zum Teilen eines Paketes, welcher auf einem Selektionspfad zu mehreren Paketen basiert

# SplitterNode_NodeName
source: Splitter
de: Teiler

# RandomLengthStringFuzzerNodeConfig_MinLengthDescription
source: Minimum length of fuzz string
de: Minimale Länge eines Fuzzstrings

# RandomLengthStringFuzzerNodeConfig_MaxLengthDescription
source: Maximum length of fuzz string
de: Maximale Länge eines Fuzzstrings

# RandomLengthStringFuzzerNodeConfig_ModeDescription
source: How the fuzzer should generate the characters
de: Gibt an, wie der Fuzzer die Zeichen generieren soll

# RandomLengthStringFuzzerNodeConfig_PatternDescription
source: When Mode is RepeatingPattern this is the string pattern to use
de: Der Stringpattern, welcher beim RepeatingPattern-Modus verwendet werden soll

# RandomLengthStringFuzzerNodeConfig_MinRandomCharDescription
source: When Mode is RandomCharacters this is the minimum character number allowed
de: Minimale Anzahl an Zeichen beim RandomCharacters-Mode

# RandomLengthStringFuzzerNodeConfig_MaxRandomCharDescription
source: When Mode is RandomCharacters this is the maximum character number allowed
de: Maximale Anzahl an Zeichen beim RandomCharacters-Mode

# RandomLengthStringFuzzerNodeConfig_AppendFuzzDescription
source: Whether to append the fuzz case to the end of the existing string
de: Gibt an, ob der Fuzzwert an den existierenden String angehängt werden soll

# RandomLengthStringFuzzerNode_Name
source: Random Length String Fuzzer Node
de: Zufällige Stringlänge des Stringfuzzerknotens

# RandomLengthStringFuzzerNode_Description
source: A node to generate random length strings
de: Ein Knoten um Strings mit zufälliger Länge zu erzeugen

# RandomLengthStringFuzzerNode_NodeName
source: String Length Fuzzer
de: Stringlängenfuzzer

# HttpDataServerConfig_HttpPathDescription
source: A glob string to match the path against, if it matches then sends the contents, otherwise it sends the 404
de: Ein globaler String um einen Pfad zu finden, bei Fund wird der Inhalt gefunden, ansonsten 404

# HttpDataServerConfig_ValidResponseDataDescription
source: The response data to send if the HttpPath matches
de: Die Antwort, die bei einem übereinstimmenden HTTP Pfad gesendet wird

# HttpDataServerConfig_NotFoundResponseDataDescription
source: The response data to send if the HttpPath does not match
de: Die Antwort, die bei einem nicht übereinstimmenden HTTP Pfad gesendet wird

# HttpDataServerConfig_CloseAfterSendingDescription
source: Specify that the connection should be closed after sending
de: Gibt an, dass die Verbindung nach dem Senden geschlossen wird

# HttpDataServerConfig_ContentTypeDescription
source: Specify the content type for the valid data
de: Gibt den Content Type der gültigen Daten an

# HttpDataServer_Name
source: Simple HTTP Server
de: Einfacher HTTP Server

# HttpDataServer_Description
source: A simple HTTP server
de: Ein einfacher HTTP server

# BinaryIntegerFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting byte position to fuzz
de: Gibt die Startposition für das Fuzzing an

# BinaryIntegerFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, must be between 1 and 8 bytes
de: Gibt die Länge der Startposition zum Fuzzen an. Der Wert muss zwischen 1 und 8 Bytes liegen

# BinaryIntegerFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to byte arrays for fuzzing, just ignore them
de: Es werden beim Fuzzen keine Knoten zu Byte Arrays konvertiert, sondern ignoriert

# BinaryIntegerFuzzerNodeConfig_MinValueDescription
source: Minimum integer value
de: Maxmimum Integer Wert

# BinaryIntegerFuzzerNodeConfig_MaxValueDescription
source: Maximum integer value
de: Maximum Integer Wert

# BinaryIntegerFuzzerNodeConfig_IncrementDescription
source: The increment value
de: Der Inkrement Wert

# BinaryIntegerFuzzerNodeConfig_LittleEndianDescription
source: Specify whether the integer is little endian or big
de: Gibt an, ob es sich bei dem Integer um einen im little endian oder big endian Format handelt

# BinaryIntegerFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed bytes should be logged as text
de: Gibt an, ob die gefuzzten Bytes als Text geloggt werden

# BinaryIntegerFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, dass die Pakete vor und nach dem Fuzzen gespeichert werden

# BinaryIntegerFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, dass mitgeschnittene Packete zu Bytes konvertiert werden, bevor diese mitgeschnitten werden.

# BinaryIntegerFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# BinaryIntegerFuzzerNode_Name
source: Binary Integer Fuzzer Node
de: Binary Integer Fuzzerknoten

# BinaryIntegerFuzzerNode_Description
source: A node to fuzz binary part using an incrementing value
de: Ein Knoten um den binären Teil mit einem inkrementierenden Wert zu fuzzen

# RandomByteFuzzerNodeConfig_MinByteValueDescription
source: Specifies the minimum byte value to use for fuzzing
de: Gibt den minimalen Bytewert fürs Fuzzen an

# RandomByteFuzzerNodeConfig_MaxByteValueDescription
source: Specified the maximum byte value to use for fuzzing
de: Gibt den maximalen Bytewert fürs Fuzzen an

# RandomByteFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to byte arrays for fuzzing, just ignore them
de: Knoten werden nicht zu Bytearrays konvertiert, sondern ignoriert

# RandomByteFuzzerNodeConfig_MaxFuzzPointsDescription
source: The maximum number of points to fuzz in the binary, if 0 then the max is the length of the packet
de: Gibt die maximale Anzahl an Punkten an, die in der Binary gefuzzt werden sollen. Bei 0 wird die maximale Länge des Paketes genommen

# RandomByteFuzzerNodeConfig_RandomFuzzPointCountDescription
source: If true then will generate a random number of fuzz bytes to change, otherwise will generate exact number
de: Wenn wahr, dann wird eine Zufällige Anzahl an Fuzzbytes generiert, ansonsten eine exakte Anzahl

# RandomByteFuzzerNodeConfig_CombinationModeDescription
source: Specify the way in which bytes are modified when fuzzing. If Random then will choose one of the other methods
de: Gibt an, auf welche Weise die Bytes beim Fuzzen modifiziert werden. Bei zufälliger Weise wird eine der anderen Methoden ausgewählt

# RandomByteFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed bytes should be logged as text
de: Gibt an, ob die gefuzzten Bytes als Text geloggt werden

# RandomByteFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, ob alle Pakete geloggt werden sollen. Dies gilt sowohl vor als auch nach dem Fuzzen

# RandomByteFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, ob die Pakete zu Bytes konvertiert werden sollen, bevor diese geloggt werden

# RandomByteFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# RandomByteFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting byte position to fuzz
de: Gibt die Startbyteposition zum Fuzzen an

# RandomByteFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means array.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen von der Startposition an, kleiner als 0 heißt string.length - fuzzlength + 1

# RandomByteFuzzerNode_Name
source: Random Byte Fuzzer Node
de: Zufälliger Bytefuzzerknoten

# RandomByteFuzzerNode_Description
source: A node to randomly fuzz binary parts of packets
de: Ein Knoten, um zufällig Binärteile eines Paketes zu fuzzen

# RandomBitFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to byte arrays for fuzzing, just ignore them
de: Knoten werden nicht zu Bytearrays konvertiert, sondern ignoriert

# RandomBitFuzzerNodeConfig_MaxFuzzPointsDescription
source: The maximum number of points to fuzz in the binary, if 0 then the max is the length of the packet
de: ibt die maximale Anzahl an Punkten an, die in der Binary gefuzzt werden sollen. Bei 0 wird die maximale Länge des Paketes genommen

# RandomBitFuzzerNodeConfig_RandomFuzzPointCountDescription
source: If true then will generate a random number of fuzz bytes to change, otherwise will generate exact number
de: Wenn wahr, dann wird eine Zufällige Anzahl an Fuzzbytes generiert, ansonsten eine exakte Anzahl

# RandomBitFuzzerNodeConfig_CombinationModeDescription
source: Specify the way in which bytes are modified when fuzzing. If Random then will choose one of the other methods
de: Gibt an, auf welche Weise die Bytes beim Fuzzen modifiziert werden. Bei zufälliger Weise wird eine der anderen Methoden ausgewählt

# RandomBitFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed bytes should be logged as text
de: Gibt an, ob die gefuzzten Bytes als Text geloggt werden

# RandomBitFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, ob alle Pakete geloggt werden sollen. Dies gilt sowohl vor als auch nach dem Fuzzen

# RandomBitFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, ob die Pakete zu Bytes konvertiert werden sollen, bevor diese geloggt werden

# RandomBitFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# RandomBitFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting byte position to fuzz
de: Gibt die Startbyteposition zum Fuzzen an

# RandomBitFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means array.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen von der Startposition an, kleiner als 0 heißt string.length - fuzzlength + 1

# RandomBitFuzzerNode_Name
source: Random Bit Fuzzer Node
de: Zufälliger Bitfuzzerknoten

# RandomBitFuzzerNode_Description
source: A node to randomly fuzz bit parts of packets
de: Ein Knoten um zufällig Bits eines Paketes zu fuzzen

# BinaryMutatorNodeConfig_MatchDescription
source: The array of bytes to match
de: Gibt das übereinstimmende Array aus Bytes an

# BinaryMutatorNodeConfig_ReplacementDescription
source: The array of bytes to replace the match with
de: Gibt das zu ersetzende Array aus Bytes an

# BinaryMutatorNode_Name
source: Binary Mutator Node
de: Binary Mutatorknoten

# BinaryMutatorNode_Description
source: A node to replace values based on a binary match
de: Ein Knoten zur Ersetzung, je nach binärer Übereinstimmung

# SimpleReplayEndpointConfig_ConvertToBasicDescription
source: If true then the packets are converted back to a basic byte form before sending
de: Wenn wahr, werden die Pakete vor dem Senden in eine einfache Byteform konvertiert

# SimpleReplayEndpointConfig_CloseAfterSendDescription
source: Indicates whether to close the connection after sending the packets
de: Gibt an, ob die Verbindung geschlossen werden soll nachdem das Paket gesendet wurde

# SimpleReplayEndpointConfig_CloseAfterRecvDescription
source: Indicates whether to close after receiving a packet
de: Gibt an, ob die Verbindung geschlossen werden soll nachdem das Paket erhalten wurde

# SimpleReplayEndpointConfig_SendAtStartDescription
source: Indicates whether to also send the packets at connection start
de: Gibt an, ob zusätzlich ein Paket beim Verbindungsstart gesendet wird

# SimpleReplayDataEndpoint_Name
source: Simple Replay Endpoint
de: Einfacher Wiederholungsendpunkt

# SimpleReplayDataEndpoint_Description
source: A simple replay endpoint which returns all packets in a log in response to an incoming packet
de: Einfacher Wiederholungsendpunkt, welcher alle Pakete beim Erhalt eines Paketes in einen Log ausgibt

# SimpleReplayDataEndpoint_NodeName
source: Simple Replay Endpoint
de: Einfacher Wiederholungsendpunkt

# DNSParser_Description
source: This is a array parser for DNS packets
de: Array Parser für DNS Pakete

# StringConverterNodeConfig_EncodingDescription
source: The binary encoding with which to process the string
de: Gibt dieie binäre Enkodierung an, mit welcher der String bearbeitet wird

# StringConverterNode_Name
source: String Converter
de: String Konvertierer

# StringConverterNode_Description
source: Converts byte data to a string in a specified encoding
de: Konvertiert binäre Daten mit entsprechendem Encoding zu einem String

# StringConverterNode_NodeName
source: String Converter
de: Stringkonvertierer

# WcfXmlMessageConfig_NoEncodeDescription
source: Do not encode the output XML back to binary data
de: Die XML-Ausgabe nicht wieder in zurück in Binärdaten enkodieren

# WcfXmlMessageConfig_NoDecodeDescription
source: Do not decode the input from binary data to XML
de: Die Binäreingabe nicht zurück in XML konvertieren

# WcfXmlMessage_Description
source: Parses a binary WCF message into XML and converts it back again
de: Parst eine binäre WCF-Nachricht in XML und konventiert es wieder zurück

# HttpRequestStreamParser_Name
source: HTTP Request Parser
de: HTTP Anfragen Parser

# HttpRequestStreamParser_Description
source: This is a HTTP request parser to apply to a stream
de: HTTP Anfragen Parser für einen Datenstrom

# HttpRequestStreamParser_NodeName
source: HTTP Request
de: HTTP Anfrage

# HTTPCookieParser_Description
source: Parser for HTTP style cookie strings. Make sure to specify the nodes to parse when configuring the graph
de: Parser für HTTP Style Cookie Strings. Gehe sicher, dass die Knoten angegeben worden sind, welche geparst werden sollen beim Konfigurieren des Graphen

# NullDataEndpoint_Description
source: A simple server which discards its input
de: Ein simpler Server, welcher die Eingabe verwirft

# RegexMutatorNodeConfig_RegexDescription
source: The regular expression to match on
de: Gibt den reguläre Ausdruck an, auf den gematcht werden soll

# RegexMutatorNodeConfig_ReplacementDescription
source: The replacement string to use on match
de: Gibt den Ersetzungsstring an, der bei einer Übereinstimmung verwendet werden soll

# RegexMutatorNodeConfig_CaseSensitiveDescription
source: Indicates whether the match should be case sensitive
de: Gibt an, ob bei einer Übereinstimmung die Groß-/Kleinschreibung beachtet werden soll

# RegexMutatorNodeConfig_MultiLineDescription
source: Indicates whether the match should ignore line breaks
de: Gibt an, ob die Übereinstimmung Zeilenumbrüche ignorieren soll

# RegexMutatorNodeConfig_StringEncodingDescription
source: The string encoding to use if the selected nodes are not strings
de: Gibt das Encoding an, welches verwendet werden soll, sofern die ausgewählten Knoten keine Strings sind

# RegexMutatorNode_Name
source: Regex Node
de: Regexknoten

# RegexMutatorNode_Description
source: A node to replace values based on a regular expression
de: Ein Knoten zum Werte ersetzen, dieser basiert auf regulären Ausdrücken

# FrameFilterMutatorNode_Name
source: Frame Filter Mutator Node
de: Frame Filter Mutatorknoten

# FrameFilterMutatorNode_Description
source: A node to filter out specific nodes of a frame
de: Ein Knoten, um bestimmte Knoten eines Frames zu filtern

# RandomStringFuzzerNodeConfig_MinLengthDescription
source: Minimum length of fuzz string
de: Minimale Länge eines Fuzzstrings

# RandomStringFuzzerNodeConfig_MaxLengthDescription
source: Maximum length of fuzz string
de: Maximale Länge eines Fuzzstrings

# RandomStringFuzzerNodeConfig_FixedLengthDescription
source: Specify that the string is just a fixed length string at MaxLength
de: Gibt an, ob der String eine feste Länge bei MaxLength hat

# RandomStringFuzzerNodeConfig_MinRandomCharDescription
source: Specify the the minimum character number allowed
de: Gibt die Mindestanzahl an erlaubten Zeichen an

# RandomStringFuzzerNodeConfig_MaxRandomCharDescription
source: Specify the maximum character number allowed
de: Gibt die Maximalanzahl an erlaubten Zeichen an

# RandomStringFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed value should be logged as text
de: Gibt an, ob der gefuzzte Wert als Text geloggt werden soll

# RandomStringFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, ob alle Pakete geloggt werden sollen. Dies gilt sowohl vor als auch nach dem Fuzzen

# RandomStringFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# RandomStringFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting string position to fuzz
de: Gibt die Startstringposition zum Fuzzen an

# RandomStringFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means string.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen von der Startposition an, kleiner als 0 heißt string.length - fuzzlength + 1
