Repository: Kaicastledine/canape
Catalog: CANAPE.NodeLibrary/Properties/Resources.*.resx
Languages: de

# RandomStringFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, ob die Pakete zu Bytes konvertiert werden sollen bevor sie geloggt werden

# RandomStringFuzzerNodeConfig_BinaryEncodingDescription
source: Specify the encoding to use if the nodes are not strings
de: Gibt das Encoding an, sofern die Knoten keine Strings sind

# RandomStringFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to strings for fuzzing, just ignore them
de: Knoten werden nicht zu Bytearrays konvertiert, sondern ignoriert

# RandomStringFuzzerNodeConfig_RegexMatchDescription
source: Specify a regex match to use to determine parts to fuzz. Replaces any matches within the selected range
de: Gibt einen Regexmatch an, um anzugeben welche Teile gefuzzt werden sollen. Hierbei werden alle Übereinstimmungen im angegebenen Bereich ersetzt

# RandomStringFuzzerNodeConfig_CaseSensitiveDescription
source: Specify the regex is casesensitive
de: Gibt an, ob bei einer Übereinstimmung die Groß-/Kleinschreibung beachtet werden soll

# RandomStringFuzzerNodeConfig_MultilineDescription
source: Specify the regex is multiline
de: Gibt an, ob die Übereinstimmung Zeilenumbrüche ignorieren soll

# RandomStringFuzzerNodeConfig_MaxReplacementsDescription
source: Specify the maximum number of replacements when using a regular expression, -1 means all
de: Gibt die maximale Anzahl an Ersetzungen bei regulären Ausdrücken an, -1 bedeutet alle

# RandomStringFuzzerNode_Name
source: Random String Fuzzer Node
de: Zufallsstringfuzzerknoten

# RandomStringFuzzerNode_Description
source: A node to fuzz parts of a string with random data
de: Ein Knoten, um Teile eines Strings mit zufälligen Werten zu fuzzen

# RandomStringFuzzerNode_NodeName
source: Random String Fuzzer
de: Zufallsstringfuzzer

# PatternStringFuzzerNodeConfig_MinLengthDescription
source: Minimum length of fuzz string
de: Minimale Länge eines Fuzzstrings

# PatternStringFuzzerNodeConfig_MaxLengthDescription
source: Maximum length of fuzz string
de: Maximale Länge eines Fuzzstrings

# PatternStringFuzzerNodeConfig_PatternDescription
source: Specify the the string pattern to use
de: Gibt das Stringpattern an

# PatternStringFuzzerNodeConfig_FixedLengthDescription
source: Specify that the string is just a fixed length string at MaxLength
de: Gibt an, ob der String nur eine feste Länge bei MaxLength hat

# PatternStringFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed value should be logged as text
de: Gibt an, ob der gefuzzte Wert als Text geloggt werden soll

# PatternStringFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, ob alle Pakete geloggt werden sollen. Dies gilt sowohl vor als auch nach dem Fuzzen

# PatternStringFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# PatternStringFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting string position to fuzz
de: Gibt den Startwert für das Fuzzen an

# PatternStringFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means string.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen von der Startposition an, kleiner als 0 heißt string.length - fuzzlength + 1

# PatternStringFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, ob die Pakete zu Bytes konvertiert werden sollen bevor sie geloggt werden

# PatternStringFuzzerNodeConfig_BinaryEncodingDescription
source: Specify the encoding to use if the nodes are not strings
de: Gibt das Encoding an, sofern die Knoten keine Strings sind

# PatternStringFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to strings for fuzzing, just ignore them
de: Knoten werden nicht zu Strings konvertiert, sondern ignoriert

# PatternStringFuzzerNodeConfig_RegexMatchDescription
source: Specify a regex match to use to determine parts to fuzz. Replaces any matches within the selected range
de: Gibt einen Regexmatch an, um anzugeben welche Teile gefuzzt werden sollen. Hierbei werden alle Übereinstimmungen im angegebenen Bereich ersetzt

# PatternStringFuzzerNodeConfig_CaseSensitiveDescription
source: Specify the regex is casesensitive
de: Gibt an, ob bei einer Übereinstimmung die Groß-/Kleinschreibung beachtet werden soll

# PatternStringFuzzerNodeConfig_MultilineDescription
source: Specify the regex is multiline
de: Gibt an, ob die Übereinstimmung Zeilenumbrüche ignorieren soll

# PatternStringFuzzerNodeConfig_MaxReplacementsDescription
source: Specify the maximum number of replacements when using a regular expression, -1 means all
de: Gibt die maximale Anzahl an Ersetzungen bei regulären Ausdrücken an, -1 bedeutet alle

# PatternStringFuzzerNode_Name
source: Pattern String Fuzzer Node
de: Strukturierte String als Fuzzknoten

# PatternStringFuzzerNode_Description
source: A node to fuzz parts of a string with patterned data
de: Ein Knoten zum Fuzzen als Teil eines Strings mit strukturierten Daten

# PatternStringFuzzerNode_NodeName
source: Pattern String Fuzzer
de: Strukturierte String als Fuzzer

# SequentialReplayEndpoint_Description
source: An endpoint which replays packets from a log sequentially on receiving
de: Ein Endpunkt welcher Packete aus einem Log sequentiell bei Empfang wiederholt

# SequentialReplayEndpoint_Name
source: Sequential Replay Endpoint
de: Sequenzielle Wiederholung eines Endpunkt

# SequentialReplayEndpointConfig_CloseAfterSendDescription
source: If true then the connection is closed after sending all the packets
de: Wenn wahr, dann wird die Verbindung geschlossen nachdem alle Packete gesendet wurden

# SequentialReplayEndpointConfig_ConvertToBasicDescription
source: If true then the packets are converted back to a basic byte form before sending
de: Wenn wahr, dann werden Packete, bevor sie gesendet werden, zurück in ein "Basic Byte" Format konvertiert

# SequentialReplayEndpointConfig_FiltersDescription
source: Specify a list of filters to filter out incoming packets for response
de: Spezifiziert eine Filterliste um eingehende Packete in der Antwort auszufiltern

# SequentialReplayEndpointConfig_MatchAllFiltersDescription
source: Indicates all filters must match
de: Angeben, dass alle Filter zutreffen müssen

# SequentialReplayEndpointConfig_PacketsDescription
source: The log of packets to send when receiving an input packet
de: Das Packetlog welches gesendet werden soll wenn ein Packet empfangen wird

# SequentialReplayEndpointConfig_RepeatCountDescription
source: Specify the number of times to send the packets
de: Spezifiziert die Anzahl wie oft Packete gesendet werden

# SequentialReplayEndpointConfig_SendAtStartDescription
source: Indicates whether to send a packet at connection start
de: Angeben ob die Packete bei einem Verbindungsaufbau gesendet werden sollen

# SequentialReplayEndpointConfig_Tag
source: Specify the tag to send, if not set then all packets will be sent
de: Spezifiert den "Tag" der gesendet werden soll, wenn nicht angegeben, werden alle Packete gesendet

# SequentialReplayEndpointConfig_WaitForResponseOnCloseDescription
source: If true wait for a reponse before closing the connection if CloseOnSend is set
de: Wenn wahr, dann wird auf eine Antwort gewartet bevor die Verbindung geschlossen wird, wenn "CloseAfterSend" gesetzt ist

# SequentialReplayEndpoint_PacketLogIsNull
source: Must specify a packet log
de: Ein Packet Log muß spezifiziert werden
