Repository: Kaicastledine/canape
Catalog: CANAPE.NodeLibrary/Properties/Resources.*.resx
Languages: de

# BinaryIntegerFuzzerNode_InvalidIncrement
source: Increment cannot be 0
de: Das Inkrement kann nicht 0 sein

# BinaryIntegerFuzzerNode_InvalidLength
source: Length must be between 1 and 8 bytes
de: Die Länge muss zwischen 1 und 8 Bytes lang sein

# BinaryIntegerFuzzerNode_NegativeInvalidMaxValue
source: Maximum value must be less than minimum for negative increments
de: Das Maximum muss kleiner sein als das Minimum bei einer negative Inkrementierung

# BinaryIntegerFuzzerNode_PositiveInvalidMaxValue
source: Maximum value must be greater than minimum for positive increments
de: Das Maximum muss gößer sein als das Minimum bei einer positive Inkrementierung

# ByteFuzzer_IgnoringNode
source: Ignoring node {0}, not a byte value
de: Der Knoten {0} wird ignoriert, da er kein Byte Wert enthält

# DuplicatorNodeConfig_DuplicationCount
source: The number of times to duplicate the matching packet, 0 means the packet will be discarded
de: Die Anzahl der Dublizierungen des übereinstimmenden Paketes, bei 0 wird das Paket verworfen

# DuplicatorNode_Description
source: A node to duplicate all incoming packets a set number of times
de: Ein Knoten um alle ankommenden Pakete zu dublizieren

# DuplicatorNode_Name
source: Duplicator Node
de: Dublizierknoten

# DuplicatorNode_NodeName
source: Duplicator
de: Duplizierer

# FilterNode_Description
source: A node to filter out packets based on specific filters
de: Ein Knoten um Pakete anhand von Filter zu filtern

# FilterNode_Name
source: Filter Node
de: Filterknoten

# InjectorNodeConfig_DropTrigger
source: If true then the triggering packet is droppped
de: Wenn wahr wird das Paket verworfen

# InjectorNodeConfig_PacketLog
source: Log of packets to inject from
de: Der Log der Pakete, welche injiziert wurden

# InjectorNodeConfig_Prefix
source: If true sends the packets before the triggering packet
de: Wenn wahr, wird das Paket gesendet bevor es getriggered wird

# InjectorNodeConfig_Repeat
source: If true then the packets will be resent each time the node fires, otherwise it will stop
de: Wenn wahr, wird das Paket jedes mal wenn der Knoten getriggert wird gesendet, ansonsten wird gestoppt

# InjectorNodeConfig_Sequential
source: If true then each packet in the log is sent everytime the node fires, otherwise it sends all packets
de: Wenn wahr, wird jedes Paket im Log immer wenn der Knoten getriggered wird gesendet, ansonsten werden alle Pakete gesendet

# InjectorNode_Description
source: A node to inject packets into the network from a packet log when the node filters match
de: Ein Knoten um Pakete in ein Netzwerk aus einem Paketlog zu injizieren, sofern der Knotenfilter passt

# InjectorNode_Name
source: Injector Node
de: Injiziererknoten

# InjectorNode_NodeName
source: Injector
de: Injizierer

# LogToPacketLogNodeConfig_ColorDescription
source: Colour of logged packet
de: Farbe des Packetlog

# LogToPacketLogNodeConfig_ConvertToBytesDescription
source: Convert packet to bytes before logging
de: Konvertiere Pakete in Bytes vor dem loggen

# LogToPacketLogNodeConfig_PacketLogDescription
source: The packet log to log packets to
de: Der Paketlog loggt Pakete nach

# LogToPacketLogNodeConfig_TagDescription
source: Tag to apply to packets
de: Tag für Paket

# LogToPacketLogNode_Description
source: A node to log packets to a packet log document instead of to the current service
de: Ein Knoten um Pakete in ein Paketlog Dokument zu speichern, anstatt in den aktuellen Service

# LogToPacketLogNode_Name
source: Log To Packet Log Node
de: In Paketknoten loggen

# LogToPacketLogNode_PacketLogIsNull
source: Must specify a packet log
de: Es muss ein Packetlog angegeben werden

# ReplayByTagDataServer_PacketLogIsNull
source: Must specify a packet log
de: Es muss ein Paketlog angeben werden

# SelectorNodeConfig_PathName
source: The path name to select on
de: Der auszuwählende Pfadname

# SelectorNode_Description
source: A node to set the current node on the frame to a selected path
de: Ein Knoten um den aktuellen Knoten auf dem Frame im ausgewählten Pfad zu setzen

# SelectorNode_Name
source: Selector Node
de: Auswahlknoten

# SelectorNode_NodeName
source: Selector
de: Auswähler

# SetMetaStateNodeConfig_ConvertSelectionToString
source: When UseSelection is true specify whether to convert the value to a string
de: Wenn UseSelection wahr ist, muss angegeben werden, ob die Daten in einen String konvertiert werden sollen

# SetMetaStateNodeConfig_Global
source: Whether to set the value in the global or local state
de: Gibt an, ob der Wert zu einem globalen oder lokalen Zustand gesetzt werden soll

# SetMetaStateNodeConfig_MetaName
source: The name of the meta value to set
de: Der Name eines zu setzenden Meta-Wertes

# SetMetaStateNodeConfig_Private
source: Whether to set the value as private or public
de: Gibt an, ob der Wert privat oder öffentlich ist

# SetMetaStateNodeConfig_ResetStateOnMatch
source: Reset the specified meta value when a filter matches, depends on whether the value is already present
de: Den gekenntzeichneten Meta-Wert zurücksetzen, sofern der Wert bereits vorhanden ist

# SetMetaStateNodeConfig_UseSelection
source: If true then will use the selection path to extract a value for the meta
de: Wenn wahr, wird der ausgewählte Pfad für den Metawert extrahiert

# SetMetaStateNodeConfig_Value
source: The value to set the meta to
de: Der zu setzende Meta-Wert

# SetMetaStateNode_Description
source: A node to set a meta value when the node filters match
de: Ein Knoten um den Meta-Wert zu setzen, sofern die Knotenfilter eine Übereinstimmung finden

# SetMetaStateNode_Name
source: Set Meta Node
de: Metaknoten setzen

# SetMetaStateNode_NodeName
source: SetState
de: Statussetzer

# SimpleReplayDataEndpoint_PacketLogIsNull
source: Must specify a packet log
de: Es muss ein Paketlog angegeben werden

# EchoDataEndpointConfig_ConvertToBasicDescription
source: If true then echo packets are converted back to a basic byte form before sending
de: Wenn wahr, werden Echo Pakete vor dem Senden in ein Basis Byte Format konvertiert

# EchoDataEndpoint_Name
source: Echo Endpoint
de: Echo Endpunkt

# EchoDataEndpoint_Description
source: A simple endpoint which echos its input
de: Ein einfacher Endpunkt, welcher seine Eingabe ausgibt

# EchoDataEndpoint_NodeName
source: Echo Endpoint
de: Echo Endpunkt

# DnsDataServerConfig_ResponseAddressDescription
source: Respond to all A requests with this IP address. Setting to 0.0.0.0 disables.
de: Auf alle A Anfragen wird mit dieser IP Addresse geantwortet. Zum Deaktivieren auf 0.0.0.0 setzen

# DnsDataServerConfig_ResponseAddress6Description
source: Respond to all AAAA requests with this IP address. Setting to :: disables
de: Auf alle AAAA Anfragen wird mit dieser IP Adresse geantwortet. Zum Deaktivieren auf :: setzen

# DnsDataServerConfig_ReverseDnsDescription
source: Specify a string which indicates a reverse name when requesting PTR records
de: Gebe einen String an, der bei einer Anfrage eines PTR Eintrages angezeigt wird

# DnsDataServerConfig_TimeToLiveDescription
source: Set the response TTL
de: Setze die TTL Antwort

# DnsDataServer_Name
source: Simple DNS Server
de: Ein einfacher DNS Server

# DnsDataServer_Description
source: A simple DNS server
de: Ein einfacher DNS Server

# Asn1ParserConfig_NoVerifyDescription
source: Do not verify the ASN1 objects before serializing back to bytes in sequences, sets and tagged objects
de: Es werden keine ASN1 Objekte vor dem deserialisieren von Bytes innerhalb von Sequenzen, Sets und markierten Objekten verifiziert

# Asn1ParserConfig_IgnoreSequencesDescription
source: Ignore sequences and leave as DER encoded bytes
de: Die Sequenzen werden ignoriert, dabei werden DER enkodierte Bytes behalten

# Asn1ParserConfig_IgnoreSetsDescription
source: Ignore sets and leave as DER encoded bytes
de: Die Sets werden ignoriert, dabei werden DER enkodierte Bytes behalten

# Asn1ParserConfig_IgnoreTaggedObjectsDescription
source: Ignore tagged objects and leave as DER encoded bytes
de: Die markierten Objekte werden ignoriert, dabei werden DER enkodierte Bytes behalten

# Asn1ParserConfig_NoDecodeDescription
source: Do not decode leaf values leave as DER encoded bytes
de: Blattwerte werden nicht dekodiert, dabei werden DER enkodierte Bytes behalten

# Asn1Parser_Description
source: Parses an ASN1 DER byte stream into separate objects and decodes the results
de: Die ASN1 DER Bytesequenz wird in seperate Objekte geparst und das Ergebnis wird dekodiert

# BinaryVectorConfig_LittleEndianDescription
source: True to read as Little Endian, false for Big Endian
de: Wahr, um als Little Endian und falsch um als Big Endian zu lesen

# BinaryVectorConfig_LengthTypeDescription
source: Type of length variable to read
de: Der zu lesende Typ der Längenvariable

# BinaryVectorConfig_InclusiveDescription
source: Indicates whether the length field's size is included in the field
de: Gibt an, ob die Größe des Feldes im Feld inkludiert werden soll

# BinaryVectorConfig_StrideDescription
source: Indicates the number of bytes per item
de: Indiziert die Anzahl der Bytes pro Item

# BinaryVectorConfig_AdjustmentDescription
source: Indicates a pre and post adjustment value in bytes to the length to account for uncounted fields
de: Gibt einen Vor- und Nachjustierungswert in Bytes für ungezählte Felder an

# BinaryVectorConfig_PrefixLenDescription
source: If the data has a fixed prefix then specify how many bytes there are
de: Sofern die Daten einen Prefix besitzen, muss dieser hier angegeben werden

# BinaryVectorParser_Name
source: Binary Vector Parser
de: Binärvektorparser

# BinaryVectorParser_Description
source: Parses a length field and reads the required byte length
de: Parsen eines Längenfelds und lesen der benötigten Bytelänge

# BaseStringFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed value should be logged as text
de: Gibt an, ob der gefuzzte Wert als Text gespeichert werden soll

# BaseStringFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, ob die Pakete vor und nach dem Fuzzen gespeichert werden

# BaseStringFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# BaseStringFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting string position to fuzz
de: Gibt die Startposition für das Fuzzing an

# BaseStringFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means string.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen der Startposition an, kleiner als 0 heißt string.length - fuzzlength + 1

# BaseStringFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, ob mitgeschnittene Packete zu Bytes konvertiert werden, bevor diese mitgeschnitten werden.

# BaseStringFuzzerNodeConfig_BinaryEncodingDescription
source: Specify the encoding to use if the nodes are not strings
de: Gibt das Encoding an, welches genutzt wird sofern die Knoten keine Strings sind

# BaseStringFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to strings for fuzzing, just ignore them
de: Gibt an, dass beim Fuzzen, Knoten nicht zu Strings konvertiert, sondern ignoriert werden

# BaseStringFuzzerNodeConfig_RegexMatchDescription
source: Specify a regex match to use to determine parts to fuzz. Replaces any matches within the selected range
de: Gibt eine Übereinstimmung für den regulären Ausdruck an, um die zu fuzzende Teile anzugeben. Dies ersetzt alle Übereinstimmungen

# BaseStringFuzzerNodeConfig_CaseSensitiveDescription
source: Specify the regex is casesensitive
de: Gibt an, ob der Regex Groß-/Kleinschreibung beachtet

# BaseStringFuzzerNodeConfig_MultilineDescription
source: Specify the regex is multiline
de: Gib an, dass der reguläre Ausdruck über mehrere Zeilen geht

# BaseStringFuzzerNodeConfig_MaxReplacementsDescription
source: Specify the maximum number of replacements when using a regular expression, -1 means all
de: Gibt die maximale Anzahl an Ersetzungen bei regulären Ausdrücken an, -1 bedeutet alle

# TextListFuzzerNodeConfig_DocumentDescription
source: Specify a document to get fuzz text from, if specified will be combined with FuzzTextList
de: Gibt ein Dokument an, von welchem aus gefuzzt werden soll. Dies wird mit FuzzTextList kombiniert

# TextListFuzzerNodeConfig_FuzzTextListDescription
source: List of fuzz text values
de: Gibt die Liste von Fuzzwerten an

# TextListFuzzerNodeConfig_SelectRandomDescription
source: Select the text value at random
de: Wahl eines zufälligen Textwertes

# TextListFuzzerNodeConfig_StoreLocalPositionDescription
source: Store the current fuzz position as a local value, it will not persist between connections
de: Speichert die aktuelle Fuzzposition in einem lokalen Wert, dies wird nicht zwischen Verbindungen behalten

# TextListFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed value should be logged as text
de: Gibt an, ob der gefuzzte Wert als Text geloggt werden soll

# TextListFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, ob alle Pakete geloggt werden sollen. Dies gilt sowohl vor als auch nach dem Fuzzen

# TextListFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# TextListFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting string position to fuzz
de: Gibt die Startstringposition für das Fuzzen an

# TextListFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means string.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen von der Startposition an, kleiner als 0 heißt string.length - fuzzlength + 1

# TextListFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, ob die Pakete zu Bytes konvertiert werden sollen, bevor sie geloggt werden

# TextListFuzzerNodeConfig_BinaryEncodingDescription
source: Specify the encoding to use if the nodes are not strings
de: Gibt das Encoding an wenn die Knoten keine Strings sind

# TextListFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to strings for fuzzing, just ignore them
de: Knoten werden während des Fuzzen nicht zu Strings konvertiert, sondern ignoriert

# TextListFuzzerNodeConfig_RegexMatchDescription
source: Specify a regex match to use to determine parts to fuzz. Replaces any matches within the selected range
de: Gibt einen Regexmatch an, um anzugeben welche Teile gefuzzt werden sollen. Ersetzt alle Übereinstimmungen im angegebenen Bereich

# TextListFuzzerNodeConfig_CaseSensitiveDescription
source: Specify the regex is casesensitive
de: Gibt an, ob der Regex Groß-/Kleinschreibung beachtet

# TextListFuzzerNodeConfig_MultilineDescription
source: Specify the regex is multiline
de: Gibt an, ob der reguläre Ausdruck über mehrere Zeilen geht

# TextListFuzzerNodeConfig_MaxReplacementsDescription
source: Specify the maximum number of replacements when using a regular expression, -1 means all
de: Gibt die maximale Anzahl an Ersetzungen bei regulären Ausdrücken an, -1 heißt alle

# TextListFuzzerNode_Name
source: Text List Fuzzer Node
de: Wörterbuch Fuzzerknoten

# TextListFuzzerNode_Description
source: A node to fuzz parts of a string using a list of text values
de: Ein Knoten um Teile eines Strings mit Hilfe einer Textliste zu fuzzen

# TextListFuzzerNode_NodeName
source: Text List Fuzzer
de: Textlistenfuzzer

# BaseRandomArrayFuzzerConfig_MaxFuzzPointsDescription
source: The maximum number of points to fuzz in the binary, if 0 then the max is the length of the packet
de: Gibt die maximale Anzahl von Fuzzpunkten innerhalb der Binary an, wenn 0 dann wird die maximale Länge des Paketes genommen

# BaseRandomArrayFuzzerConfig_RandomFuzzPointCountDescription
source: If true then will generate a random number of fuzz bytes to change, otherwise will generate exact number
de: Wenn wahr, wird eine zufällige Anzahl an Fuzzbytes generiert, ansonsten eine exakte Anzahl

# BaseRandomArrayFuzzerConfig_CombinationModeDescription
source: Specify the way in which bytes are modified when fuzzing. If Random then will choose one of the other methods
de: Gibt die Art an, in welcher Art die Bytes beim Fuzzen modifiziert werden. Bei zufälliger Art sollte eine andere Methode benutzt werden

# BaseRandomArrayFuzzerConfig_LogFuzzTextDescription
source: Specify that the fuzzed bytes should be logged as text
de: Gibt an, ob die gefuzzten Bytes als Text geloggt werden sollen

# BaseRandomArrayFuzzerConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, ob die Pakete vor und nach dem Fuzzen gespeichert werden sollen

# BaseRandomArrayFuzzerConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, ob mitgeschnittene Packete zu Bytes konvertiert werden, bevor diese mitgeschnitten werden

# BaseRandomArrayFuzzerConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# BaseRandomArrayFuzzerConfig_FuzzStartDescription
source: Specify the starting byte position to fuzz
de: Gibt die Startposition für das Fuzzen an

# BaseRandomArrayFuzzerConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means array.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen von der Startposition an, kleiner als 0 heißt string.length - fuzzlength + 1

# RandomCharArrayFuzzerNodeConfig_MinValueDescription
source: Specifies the minimum char value to use for fuzzing
de: Gibt den Mindestzeichenwert für das Fuzzing an

# RandomCharArrayFuzzerNodeConfig_MaxValueDescription
source: Specified the maximum char value to use for fuzzing
de: Gibt den Maximalzeichenwert für das Fuzzing an

# RandomCharArrayFuzzerNodeConfig_NoConversionDescription
source: Do not convert nodes to byte arrays for fuzzing, just ignore them
de: Die Knoten sollen nicht zu Bytearrays konvertiert werden, daher werden diese ignoriert

# RandomCharArrayFuzzerNodeConfig_StringEncodingDescription
source: Specify the text encoding to use if the node is not a string/char array
de: Gibt das Textencoding an, welches verwendet werden soll, sofern der Knoten kein Zeichen oder Stringarray ist

# RandomCharArrayFuzzerNodeConfig_MaxFuzzPointsDescription
source: The maximum number of points to fuzz in the binary, if 0 then the max is the length of the packet
de: Gibt die maximale Anzahl an Punkten an, die in der Binary gefuzzt werden sollen. Wenn 0 dann wird die maximale Länge des Paketes genommen

# RandomCharArrayFuzzerNodeConfig_RandomFuzzPointCountDescription
source: If true then will generate a random number of fuzz bytes to change, otherwise will generate exact number
de: Wenn wahr, wird eine Zufällige Anzahl an Fuzzbytes generiert, ansonsten eine exakte Anzahl

# RandomCharArrayFuzzerNodeConfig_CombinationModeDescription
source: Specify the way in which bytes are modified when fuzzing. If Random then will choose one of the other methods
de: Gibt an, auf welche Weise die Bytes beim Fuzzen modifiziert werden. Bei zufälliger Weise wird eine der anderen Methoden ausgewählt

# RandomCharArrayFuzzerNodeConfig_LogFuzzTextDescription
source: Specify that the fuzzed bytes should be logged as text
de: Gibt an, ob die gefuzzten Bytes als Text geloggt werden

# RandomCharArrayFuzzerNodeConfig_LogPacketsDescription
source: Specify that the packets are logged before and after fuzzing
de: Gibt an, ob alle Pakete sowohl vor als auch nach dem Fuzzen geloggt werden

# RandomCharArrayFuzzerNodeConfig_ConvertToBytesDescription
source: Specify that logged packets should be converted to bytes before logging
de: Gibt an, ob die Pakete zu Bytes konvertiert werden, bevor sie geloggt werden

# RandomCharArrayFuzzerNodeConfig_ColorDescription
source: Specify the log color to use
de: Gibt die Farbe des Log an

# RandomCharArrayFuzzerNodeConfig_FuzzStartDescription
source: Specify the starting byte position to fuzz
de: Gibt die Startbyteposition zum Fuzzen an

# RandomCharArrayFuzzerNodeConfig_FuzzLengthDescription
source: Specify the length to fuzz from the start position, less than 0 means array.length - fuzzlength + 1
de: Gibt die Länge zum Fuzzen von der Startposition an, kleiner als 0 heißt string.length - fuzzlength + 1

# SimpleReplayByTagEndpointConfig_ConvertToBasicDescription
source: If true then the packets are converted back to a basic byte form before sending
de: Wenn wahr, werden die Pakete in eine einfache Byteform konvertiert, bevor diese geloggt werden

# SimpleReplayByTagEndpointConfig_PacketsDescription
source: The log of packets to send
de: Der Log der Pakete die gesendet werden sollen

# SimpleReplayByTagEndpointConfig_CloseAfterMatchDescription
source: Indicates whether to close the connection after matching the filters and sending the packets
de: Gibt an ob die Verbindung geschlossen werden soll, nachdem die Filter Übereinstimmungen gefunden haben und das Paket gesendet wurde

# SimpleReplayByTagEndpointConfig_CloseAfterNonMatchDescription
source: Indicates whether to close the connection after not matching the filters and sending the packets
de: Gibt an ob die Verbindung geschlossen werden soll, nachdem die Filter Übereinstimmungen nicht gefunden haben und das Paket gesendet wurde

# SimpleReplayByTagEndpointConfig_FiltersDescription
source: List of filters to apply to incoming packets to determine whether to send the packets
de: Liste an Filtern die auf hereinkommende Pakete angewendet werden sollen, um zu überprüfen ob das Paket gesendet werden soll

# SimpleReplayByTagEndpointConfig_MatchAllFiltersDescription
source: Indicates all filters must match
de: Gibt an, dass alle Filter matchen müssen

# SimpleReplayByTagEndpointConfig_TagOnMatchDescription
source: Specifies the packet tag to send when the filters match
de: Gibt die Paketmarkierung an die gesendet werden soll wenn die Filter eine Übereinstimmung finden

# SimpleReplayByTagEndpointConfig_RepeatOnMatchDescription
source: Specifies the number of times to send the on match packets
de: Gibt die Anzahl an wie oft ein Paket bei einer Übereinstimmung gesendet werden soll

# SimpleReplayByTagEndpointConfig_TagOnNonMatchDescription
source: Specifies the packet tag to send when the filters do not match
de: Gibt die Paketmarkierung an die gesendet werden soll wenn die Filter keine Übereinstimmung finden

# SimpleReplayByTagEndpointConfig_RepeatOnNonMatchDescription
source: Specifies the number of times to send the on non-match packets
de: Gibt die Anzahl an wie oft ein Paket bei einer Nichtübereinstimmung gesendet werden soll

# SimpleReplayByTagEndpointConfig_TagOnStartDescription
source: Specifies the packet tag to send when the endpoint starts, if empty then no packets sent
de: Gibt an welche Paketmarkierung gesender werden soll wenn der Endpunkt anfängt, wenn leer werden keine Pakete gesendet

# SimpleReplayByTagEndpointConfig_RepeatOnStartDescription
source: Specifies the number of times to send the start packets
de: Gibt die Anzahl an wie oft ein Startpaket gesendet werden soll

# SimpleReplayByTagEndpoint_Name
source: Simple Replay by Tag Endpoint
de: Einfache Wiederholung einer Endmarkierung

# SimpleReplayByTagEndpoint_Description
source: A simple replay endpoint which returns specifically tagged packets in a log in response to an incoming packet
de: Ein einfacher Wiederholungsendpunkt, der als Antwort auf ein hereinkommendes Paket ein speziell markiertes Paket in einem Log zurückgibt

# SimpleReplayByTagEndpoint_NodeName
source: Tag Replay Endpoint
de: Wiederholungsendpunkt markieren
