Repository: Kaicastledine/canape
Catalog: CANAPE.Parser/Properties/Resources.*.resx
Languages: de

# BitFieldMemberEntry_BitsDescription
source: The number of bits if using a bit field
de: Die Anzahl der Bits beim Benutzen eines Bitbereiches

# BitField_InvalidSize
source: Bit field must be between 0 and 64 bits in size
de: Der Bitbereich muss zwischen 0 and 64 Bits groß sein

# BooleanMemberEntry_FalseValueDescription
source: The value to use for False
de: Der Wert, der bei Falsch genutzt wird

# BooleanMemberEntry_InvalidValue
source: Cannot represent value {0} in a {1}
de: Der Wert {0} kann in einem {1} nicht angezeigt werden

# BooleanMemberEntry_TrueValueDescription
source: The value to use for True
de: Der Wert, der bei Wahr genutzt wird

# CharMemberEntry_StringEncodingDescription
source: The encoding to use for the string
de: Die für den String gewählte Encodierung

# ContainerMemberEntry_BaseTypeDescription
source: The base member type
de: Der Basis Benutzertyp

# EnumMemberEntry_EnumTypeDescription
source: The enumeration type for this entry
de: Der Aufzählungstyp für diesen Eintrag

# EnumParserType_IsFlagsDescription
source: Indicates if this enumeration is flags or values
de: Zeigt ob die Aufzählung aus Flags oder Werten besteht

# FixedLengthGenericArrayMemberEntry_LengthDescription
source: Length of the fixed array in elements
de: Länge des festgelegten Arrays in Elementen

# FixedLengthPrimitiveArrayMemberEntry_IsByteLengthDescription
source: Indicates whether the Length field is a number of elements or number of bytes
de: Zeigt, ob die Feldlänge der Länge der Elemente oder Bytes entspricht

# FixedLengthPrimitiveArrayMemberEntry_LengthDescription
source: Length of the fixed array in elements
de: Die Länge des festgelegten Arrays in Elementen

# FixedLengthStringMemberEntry_Description
source: A string which is fixed in length
de: Ein String mit angepasster Länge

# FixedLengthStringMemberEntry_IsByteLengthDescription
source: Indicates whether the Length field is a number of elements or number of bytes
de: Zeigt, ob die Feldlänge der Länge der Elemente oder Bytes entspricht

# FixedLengthStringMemberEntry_LengthDescription
source: The length of the fixed string in characters units
de: Länge des Textes in Buchstaben

# FixedLengthStringMemberEntry_PaddingDescription
source: A character to use to pad the string to the correct length if it is too short
de: Ein Zeichen, welches als Padding genutzt wird, sofern der String zu kurz ist

# FixedLengthStringMemberEntry_StringLengthInvalid
source: String must be greater or equal to 0 characters
de: Die Länge des Strings muss größer oder gleich 0 sein

# FloatPrimitiveMemberEntry_InvalidType
source: Type must be a float or double
de: Der Typ muss float oder double sein

# GenericStreamParser_ReadException
source: Received exception '{0}' while reading type {1}
de: Ausnahme '{0}' beim Lesen des Types {1}

# GenericStreamParser_WriteException
source: Received exception '{0}' while writing type {1}
de: Ausnahme '{0}' beim Schreiben des Types {1}

# IntegerMemberEntry_InvalidType
source: Type must be a primitive type
de: Der Typ muss primitiv sein

# IntegerPrimitiveMemberEntry_FormatDescription
source: Specify the display format of the member
de: Spezifiziere das Anzeigeformat für die Mitglieder

# IntegerPrimitiveMemberEntry_InvalidType
source: Type must be an integer type
de: Der Typ muss ein Integer sein

# MemberEntryReference_CouldNotFindMember
source: Cannot find member {0} in reference chain
de: Das Mitglied {0} konnte in der Referenzkette nicht gefunden werden

# MemberEntryReference_InvalidChain
source: Reference chain is invalid
de: Die Referenzkette ist ungültig

# MemberEntryReference_InvalidChainMustEndWithTypes
source: Chains must end with built-in types
de: Ketten müssen mit eingebauten Typen enden

# MemberEntryReference_InvalidChainMustStartWithSequences
source: Chains with multiple items must start with sequences
de: Ketten mit mehreren Items müssen mit einer Sequenz starten

# MemberEntry_DescriptionDescription
source: Specify a textual description for this member
de: Es muss eine Textbeschreibung für das Mitglied angegeben werden

# MemberEntry_DisplayClassDescription
source: Specify a guid which determines how the node should be edited and displayed
de: Es muss eine Anleitung angegeben werden, wie der Knoten editiert und angezeigt werden soll

# MemberEntry_HiddenDescription
source: If set the member is not output in the final structure
de: Wenn das Mitglied nicht in der letzten Ausgabe ist

# MemberEntry_InvalidFieldReference
source: Invalid field reference
de: Ungültige Feldreferenz

# MemberEntry_InvalidName
source: Name '{0}' is not a valid identifier
de: Der Name '{0}' ist kein gültiger Identifizierer

# MemberEntry_InvalidReference
source: {0} does not exist as a reference
de: {0} existiert nicht als Referenz

# MemberEntry_NameAlreadyExists
source: Name '{0}' already exists in the sequence
de: Der Name '{0}' existiert bereits in dieser Referenz

# MemberEntry_NameDescription
source: Name of the member entry
de: Der Name des Mitgliedeintrages

# MemberEntry_ReadOnlyDescription
source: If set the member is read only in the final structure
de: Wenn gesetzt, ist das Mitglied nur lesbar in der finalen Struktur

# MemberEntry_TypeNameDescription
source: Name of the type
de: Name des Typ

# MemberEntry_UuidDescription
source: Unique ID of the type
de: Einzigartige ID des Typ

# NumericPrimitiveMemberEntry_CustomFormatDescription
source: Specifies a custom format string for the data (overrides anything else)
de: Gebe einen beliebigen String für die Daten an(überschreibt alles andere)

# NumericPrimitiveMemberEntry_EndianDescription
source: The endian of the type for parsing (not applicable for bytes)
de: Die Endianness des Typen fürs Parsing (nicht auf Bytes anwendbar)

# ParserType_DescriptionDescription
source: Specify a textual description for this type
de: Es muss eine Textbeschreibung für diesen Typen angegeben werden

# ParserType_DisplayClassDescription
source: Specify a guid which determines how the node should be edited and displayed
de: Es muss eine Anleitung angegeben werden, wie der Knoten editiert und angezeigt werden soll

# ParserType_UuidDescription
source: Unique ID of the type
de: Einzigartige ID des Typ

# ParserUtils_InvalidPrimitiveType
source: Invalid primitive type
de: Ungültiger primitiver Typ

# ReferenceLengthGenericArrayMemberEntry_AdjustmentDescription
source: Specify an adjust value for the length which is added at deserialization and subtracted and serialization
de: Es muss ein Anpassungswert angegeben werden, welcher bei der Deserialisierung entfernt und bei der Serialisierung hinzugefügt wird

# ReferenceLengthGenericArrayMemberEntry_IsByteLengthDescription
source: Indicates whether the Length field is a number of elements or number of bytes
de: Gibt an, ob die Feldlänge der Länge der Elemente oder Bytes entspricht

# ReferenceLengthGenericArrayMemberEntry_ReferenceDescription
source: Define the member reference to get the length from
de: Definition der Mitgliederreferenz, aus welcher die Länge geladen wird

# ReferenceLengthPrimitiveArrayMemberEntry_AdjustmentDescription
source: Specify an adjust value for the length which is added at deserialization and subtracted and serialization
de: Es muss ein Anpassungswert angegeben werden, welcher bei der Deserialisierung entfernt und bei der Serialisierung hinzugefügt wird

# ReferenceLengthPrimitiveArrayMemberEntry_IsByteLengthDescription
source: Indicates whether the Length field is a number of elements or number of bytes
de: Gibt an, ob die Feldlänge der Länge der Elemente oder Bytes entspricht

# ReferenceLengthPrimitiveArrayMemberEntry_ReferenceDescription
source: Define the member reference to get the length from
de: Definiere die Mitgliederreferenz, aus welcher die Länge geladen wird

# ReferenceLengthStringMemberEntry_AdjustmentDescription
source: Specify an adjust value for the length which is added at deserialization and subtracted and serialization
de: s muss ein Anpassungswert angegeben werden, welcher bei der Deserialisierung entfernt und bei der Serialisierung hinzugefügt wird

# ReferenceLengthStringMemberEntry_IsByteLengthDescription
source: Indicates whether the Length field is a number of elements or number of bytes
de: Gibt an, ob die Feldlänge der Länge der Elemente oder Bytes entspricht

# ReferenceLengthStringMemberEntry_ReferenceDescription
source: Define the member reference to get the length from
de: Definiere die Mitgliederreferenz, aus welcher die Länge geladen wird

# SequenceParserType_DefaultEndian
source: The endian of the integer type for parsing
de: Die Endianness des Integertypen fürs Parsing

# SequenceParserType_MemberAlreadyParented
source: {0} is already a member of another type
de: {0} ist bereits Mitglied eines anderen Types

# SequenceParserType_NameExists
source: {0} already exists as a member
de: {0} ist bereits Mitglied

# SequenceParserType_NotOurMember
source: Provided member is not part of this sequence type
de: Übergebenes Mitglied ist kein Mitglied des Sequenztypes

# StreamParserType_FormatStringDescription
source: Specify a format string, uses a syntax similar to perl replacement, e.g. "Format $var" will lookup the value 'var' and replace
de: Gebe einen formatierten String an, hierbei sollte eine ähnliche Syntax wie bei einer Ersetzung in Perl genutzt werden, z.B. "Format $var" würde den Wert von 'var' auslesen und ersetzen

# StringMemberEntry_StringEncodingDescription
source: The encoding to use for the string
de: Die für den String benutzte Encodierung

# TerminatedStringMemberEntry_TermCharDescription
source: A character to indicate the end of string
de: Ein Zeichen, welches das Ende des Strings kennzeichnet
