Repository: Kaicastledine/canape
Catalog: CANAPE.Controls/Properties/Resources.*.resx
Languages: de

# FillBytesForm_EmptyHexString
source: Hex string cannot be empty
de: Der Hexstring darf nicht leer sein

# FillBytesForm_InvalidHexString
source: Hex string is invalid
de: Der Hexstring ist ungültig

# FillBytesForm_MinMaxInvalid
source: Minimum byte value must be less than maximum
de: Der minimale Bytewert muss kleiner sein als der maximale Bytewert

# FillBytesForm_InvalidHexStringLength
source: Hex string must be multiples of two characters
de: Der Hexstring muss ein Vielfaches von zwei Hexzeichen sein

# MessageBox_ErrorString
source: Error
de: Fehler

# NetGraphDocumentControl_NoDocumentSet
source: No document set in node, do you want to create a new document?
de: Kein Dokument im Knoten

# NetGraphDocumentControl_NoDocumentSetCaption
source: New Document?
de: Neues Dokument?

# BinaryDataEditorControl_NoMatch
source: Could not find a match
de: Es konnte keine Übereinstimmung gefunden werden

# BinaryDataEditorControl_NoMatchCaption
source: No Match
de: Keine Übereinstimmung

# TreeDataKeyEditorControl_NoMatch
source: Could not find a match
de: Es konnte keine Übereinstimmung gefunden werden

# TreeDataKeyEditorControl_NoMatchCaption
source: No Match
de: Keine Übereinstimmung

# ScriptSelectForm_Caption
source: Error
de: Fehler

# ScriptSelectForm_NoClass
source: Must specify a class
de: Es muss eine Klasse angegeben werden

# ScriptSelectForm_NoDocument
source: Must specify a script document
de: Es muss ein Skriptdokument angegeben werden

# ChangeTagForm_UseEmptyTag
source: Do you to specify an empty tag?
de: Wurde ein leeres Tag spezifiziert?

# ChangeTagForm_UseEmptyTagCaption
source: Empty Tag?
de: Leeres Tag?

# TreeDataKeyEditorControl_ParseError
source: Parse Error
de: Parserfehler

# TreeDataKeyEditorControl_NoParseResults
source: No results returned from parse with
de: Es wurde kein Ergebnis vom Parser zurückgegeben

# TreeDataKeyEditorControl_NoParseResultsCaption
source: No results
de: Keine Ergebnisse

# ScriptDocumentControl_NoMatch
source: Could not find a match
de: Es konnte keine Übereinstimmung gefunden werden

# ScriptDocumentControl_NoMatchCaption
source: No Match
de: Keine Übereinstimmung

# GotoLineForm_Label
source: Line Number (1 - {0})
de: Zeilennummer (1 - {0})

# ParserDocumentControl_InvalidIdentifier
source: Name '{0}' is not a valid identifier
de: Der Name '{0}' ist kein gültiger Bezeichner

# ParserDocumentControl_InvalidIdentifierCaption
source: Invalid name
de: Ungültiger Name

# ParserDocumentControl_TypeNameExists
source: Type {0} already exists, please choose a different name
de: Der Typ {0} existiert bereits. Bitte einen anderen Namen wählen.

# ParserDocumentControl_TypeNameExistsCaption
source: Type name exists
de: Der Typname existiert bereits

# ParserDocumentControl_RemoveType
source: Do you want to remove {0}?
de: Wollen Sie {0} löschen?

# ParserDocumentControl_RemoveTypeCaption
source: Remove {0}?
de: {0} löschen?

# InjectPacketForm_NotSupported
source: Could not inject at specified node. Not supported
de: Es konnte nicht an spezifiziertem Knoten injiziert werden

# InjectPacketForm_SelectGraph
source: No connection available for injection
de: Es ist keine Verbindungen für die Injizierung vorhanden

# ParserDocumentControl_Validation
source: Parser validated ok
de: Der Parser validierte erfolgreich

# ParserDocumentControl_ValidationCaption
source: Validation Passed
de: Validierung erfolgreich

# ParserDocumentControl_ValidationError
source: Validation Error
de: Fehler bei der Validierung

# InjectPacketForm_SelectNode
source: No node selected for injection
de: Es wurde kein Knoten für die Injizierung ausgewählt

# SelectBlockForm_EndOffsetLessThanOffset
source: The end offset must be greater or equal to start offset
de: Der Endoffset muss größer oder gleich dem Anfangsoffset sein

# SelectBlockForm_OffsetGreaterThanSize
source: The offset must be less than the size of the hex ({0} bytes)
de: Das Offset muss kleiner als ({0} Hexbytes sein

# HexEditor_InvalidBase64Length
source: Selected data has an invalid base64 length, should be a multiple of 4 bytes.
de: Die ausgewählten Daten haben eine ungültige base64-Länge. Diese muss ein Vielfaches von vier Bytes sein

# AllFilesFilter_String
source: All Files (*.*)|*.*
de: Alle Dateien (*.*)|*.*

# PacketLogControl_ClearLog
source: Do you want to clear the log?
de: Soll der Log gelöscht werden?

# PacketLogControl_ClearLogCaption
source: Clear Log?
de: Log löschen?

# PacketLogControl_DataColumn
source: Data
de: Daten

# PacketLogControl_ErrorReadingFile
source: Error reading file {0}
de: Fehler beim Lesen der Datei {0}

# PacketLogControl_ErrorWritingPackets
source: Error writing packets '{0}'
de: Fehler beim Schreiben des Paketes '{0}'

# PacketLogControl_LengthColumn
source: Length
de: Länge

# PacketLogControl_NetworkColumn
source: Network
de: Netzwerk

# PacketLogControl_NoColumn
source: No
de: Nein

# PacketLogControl_SelectDiffPackets
source: Must select two packets to difference
de: Es müssen zwei Pakete für das bilden der Differenz ausgewählt werden

# PacketLogControl_TimestampColumn
source: Timestamp
de: Zeitstempel

# TextFileFilter_String
source: Text Files (*.txt)|*.txt|All Files (*.*)|*.*
de: Textdateien (*.txt)|*.txt|Alle Dateien (*.*)|*.*

# SslConfigControl_SpecifyCertPrivateKey
source: You must provide a certificate with a private key
de: Sie müssen ein Zertifikat mit privatem Schlüssel bereitstellen

# InjectPacketControl_CancelButtonText
source: Cancel
de: Abbrechen

# StringConverters_InvalidHexStringLength
source: Hex string must be a multiple of 2 hex characters
de: Der Hexstring muss ein Vielfaches von zwei Hexzeichen sein

# ConfigurePacScriptForm_TestReturned
source: Test returned '{0}'
de: Der Test gab '{0}' zurück

# CreateCertForm_MustSpecifyCA
source: Must specify a root certificate
de: Das Rootzertifikat muss spezifiziert werden

# CreateCertForm_MustSpecifyCN
source: Must specify a common name
de: Das Common Name Feld muss spezifiziert werden

# CreateCertForm_CertSelect
source: Certificate Select
de: Zertifikatsausswahl

# CreateCertForm_CertSelectTitle
source: Select a certificate from the following list
de: Es muss ein Zertifikate aus der Liste ausgewählt werden

# CreateCertForm_NoStoreCerts
source: No available certificates with private keys found in store
de: Es konnten keine Zertifikate im privaten Schlüsselspeicher gefunden werden

# CreateCertForm_StoreError
source: Information could not be written out for this certificate.
de: Es konnten keine Informationen zu diesem Zertifikat geschrieben werden

# EditFilterForm_InvalidRegex
source: Invalid regular expression
de: Ungültiger regulärer Ausdruck

# EditFilterForm_MustProvideHost
source: Must provide a host (* is wildcard)
de: Es muss ein Host angeben werden(* ist Platzhalter)

# EditPacketForm_Title
source: Edit Packet - {0}
de: Paket editieren - {0}

# FindPacketForm_CancelButtonText
source: Cancel
de: Abbrechen

# FindPacketForm_FindButtonText
source: Find
de: Suchen

# FindPacketForm_SelectMode
source: Error, must specify a matching mode
de: Fehler, der Übereinstimmungsmodus muss gesetzt werden

# FindPacketForm_SelectModeEncoding
source: Must select a mode and an encoding
de: Der Modus und die Enkodierung muss ausgewählt werden

# FindPacketForm_SpecifySearch
source: Must provide a search string
de: Der Suchstring muss angegeben werden

# HistogramLogViewerForm_Title
source: Histogram from {0} packet(s), {1} byte(s)
de: Das Histogram von {0} Paket(en), {1} Byte(s)

# LoadCertFromFileForm_CertFilter
source: PFX Certificate (*.pfx;*.p12)|*.pfx;*.p12|Certificate Files (*.cer,*.pem,*.crt,*.der)|*.cer;*.pem;*.crt;*.der|All Files (*.*)|*.*
de: PFX Zertifikate (*.pfx;*.p12)|*.pfx;*.p12|Zertifikatdateien (*.cer,*.pem,*.crt,*.der)|*.cer;*.pem;*.crt;*.der|All Files (*.*)|*.*

# LoadCertFromFileForm_KeyFilter
source: Key File (*.key)|*.key|All Files (*.*)|*.*
de: Schlüsseldatei (*.key)|*.key|Alle Dateien (*.*)|*.*

# LoadCertFromFileForm_NoPrivateKey
source: Certificate does not have a private key
de: Das Zertifikat hat keinen privaten Schlüssel

# LoadCertFromFileForm_SpecifyCert
source: Must specify a certificate file
de: Die Zertifikatdatei muss angegeben werden

# LoadCertFromFileForm_SpecifyKey
source: Must specify a key file
de: Die Schlüsseldatei muss angegeben werden

# PacketLogViewerForm_ConvertToBytes
source: Do you want to convert this packet to bytes?
de: Soll dieses Paket in Bytes konvertiert werden?

# PacketLogViewerForm_ConvertToBytesCaption
source: Convert?
de: Konvertieren?

# PacketLogViewerForm_Header
source: {0} of {1} - {2} - {3} - {4}
de: {0} aus {1} - {2} - {3} - {4}

# PacketLogViewerForm_Title
source: Packet Log
de: Paketlog

# PacketLogViewerForm_TitleReadOnly
source: Packet Log - Read Only
de: Paketlog - Schreibgeschützt

# PrimitiveValueEditorForm_InvalidValue
source: Invalid value - {0}
de: Fehlerhafter Wert - {0}

# ProjectExplorer_AssembliesFileFilter
source: Assemblies (*.dll;*.exe)|*.dll;*.exe|All Files (*.*)|*.*
de: Assemblies (*.dll;*.exe)|*.dll;*.exe|Alle Dateien (*.*)|*.*

# ProjectExplorer_CouldntCreateTest
source: Could not create test type
de: Der Testtyp konnte nicht erstellt werden

# ProjectExplorer_DataNodeName
source: Data
de: Daten

# ProjectExplorer_DeleteDocument
source: Do you want to delete document '{0}'?
de: Soll das Dokument '{0}' gelöscht werden?

# ProjectExplorer_DeleteDocumentCaption
source: Delete?
de: Löschen?

# ProjectExplorer_GraphsNodeName
source: Graphs
de: Graphen

# ProjectExplorer_RootNodeName
source: Project
de: Projekt

# ProjectExplorer_ScriptsNodeName
source: Scripts
de: Skripte

# ProjectExplorer_ServicesNodeName
source: Services
de: Dienste

# SelectEndointForm_SelectServer
source: Must select a template
de: Ein Server muss aus angegeben werden

# SelectEndpointForm_SelectClass
source: Must specify a class
de: Eine Klasse muss angegeben werden

# SelectEndpointForm_SelectScript
source: Must specify a script document
de: Ein Skriptdokument muss angegeben werden

# SelectLibraryNodeForm_DescriptionColumn
source: Description
de: Beschreibung

# SelectLibraryNodeForm_SelectNode
source: Must select a node type
de: Ein Knotentyp muss angegeben werden

# SelectScriptTemplateForm_EmptyScript
source: Empty
de: Leer

# SelectScriptTemplateForm_EmptyScriptDescription
source: An empty script file
de: Eine leere Skriptdatei

# SelectTemplateForm_DescriptionColumn
source: Description
de: Beschreibung

# SelectTemplateForm_SpecifyTemplate
source: Must select a template type
de: Ein Templatetyp muss ausgewählt werden

# ConfigurePacScriptForm_CannotUseProxyScript
source: Could not create proxy script factory
de: Es konnte kein Proxyscriptbetrieb erstellt werden

# AddReferenceForm_MustSpecifyAnAssemblyName
source: Must specify an assembly name for manual loading
de: Ein Assemblername muss für manuelles Laden spezifiziert werden.

# CreateCertForm_MustSpecifyTemplate
source: Must specify a template certificate
de: Ein Templatezertifikat muss angegeben werden

# LineContainer_LabelDescription
source: The label to assign to the line. Allows a node to specify which route a packet should take
de: Ein Label was der Zeile zugewiesen wird. Gibt einem Knoten die Möglichkeit zu spezifizieren, welche Route ein Paket nehmen soll

# EditConfigPropertyForm_SelectAType
source: Please select a type for the property
de: Ein Eigenschaftstypen muss angegeben werden.

# EditConfigPropertyForm_SpecifyAName
source: Please specify a valid name, it must only contain letters, digits or underscores and must not start with a digit
de: Ein gültiger Name muss angegeben werden. Es sind nur Buchstaben, Zahlen, Unterstriche erlaubt und der Name darf nicht mit einer Zahl beginnen

# CreateCertForm_SpecifyPassword
source: Certificate key is protected, do you want to specify the password?
de: Das Zertifikat ist geschützt. Wollen Sie ein Passwort angeben?

# CreateCertForm_SpecifyPasswordCaption
source: Specify Password?
de: Passwordeingabe

# SslConfigControl_ErrorLoadingStoreCert
source: Error loading certificate from store: {0}
de: Ein Fehler beim Laden des Zertifikates aus dem Speicher ist aufgetreten: {0}

# SslConfigControl_NoPrivateKeyInStore
source: No available certificates with private keys found in store
de: Es wurden keine verfügbaren Zertifikate mit privatem Schlüssel im Speicher gefunden

# LoadCertFromFileForm_InvalidPrivateKeyFile
source: Could not load private key from file
de: Es konnte keinen privaten Schlüssel aus der Datei geladen werden

# EventLogControl_ClearLog
source: Do you want to clear the log?
de: Soll der Log gelöscht werden?

# EventLogControl_ClearLogCaption
source: Clear Log?
de: Log löschen?

# EventLogControl_TextFilesFilter
source: Text Files (*.txt)|*.txt|All Files (*.*)|*.*"
de: Text Dateien(*.txt)|*.txt|Alle Dateien (*.*)|*.*"

# PacketLogViewerForm_ConfirmSave
source: Log contains modified data, do you want to save now?
de: Der Log enthält veränderte Daten. Speichern?

# PacketLogViewerForm_ConfirmSaveCaption
source: Save?
de: Speichern?

# ParserDocumentControl_RootNodeName
source: Project
de: Projekt

# ParserDocumentControl_CSSourceFilter
source: C# Source File (*.cs)|*.cs|All Files (*.*)|*.*
de: C# Sourcecode Datei (*.cs)|*.cs|Alle Dateien (*.*)|*.*

# BinaryFrameDiffControl_NoDifferenceFound
source: No differences found
de: Keine Unterschiede gefunden

# BinaryFrameDiffControl_NoDifferenceFoundCaption
source: No Differences
de: Kein Unterschied
